Revit 2027 API
Connector.AssignedFlow Property
The assigned flow of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AssignedFlow { get; set; }
Public Property AssignedFlow As Double
	Get
	Set
public:
property double AssignedFlow {
	double get ();
	void set (double value);
}
member AssignedFlow : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainPiping or DomainHvac. Thrown when the connector is not in a family instance.
ArgumentException |  Thrown when set an invalid value.
InvalidOperationException |  Thrown on failure to get or set assigned flow.
Remarks
Assigned flow may be assigned for connectors of some family instances. In order to set this property, it must be mapped to a writable instance parameter in the family definition.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace